[
  {
    "title": "Frontend Intern",
    "organization": "AudioShelf",
    "location": "Amherst, Massachusetts, U.S.A.",
    "duration": "Nov 2022 - Feb 2022",
    "description": [
      "Creating the next generation platform for streaming audio content using React Native",
      "Enhanced app performance by implementing caching in the app with automatic updates occurring when required",
      "Added new features, raised issues, and resolved bugs"
    ],
    "logo": "AudioShelf.webp"
  },
  {
    "title": "Software Engineeer Intern",
    "organization": "Altius Strategic Consulting",
    "location": "California, U.S.A.",
    "duration": "May 2022 - Aug 2022",
    "description": [
      "Transformed existing Machine Learning pipelines using Java ML Kit to perform on-device processing on Android",
      "Architected cloud services through AWS Lambda, DynamoDB, API Gateway, S3 into the mobile application",
      "Developed client-facing user interface and implemented user authentication via Firebase"
    ],
    "logo": "ASC.webp"
  },
  {
    "title": "Software Developer",
    "organization": "CICSoft",
    "location": "Amherst, Massachusetts, U.S.A.",
    "duration": "Feb 2022 - Present",
    "description": [
      "Developed and integrated new features for the organization",
      "Conducted bootcamp sessions for 50 students on Android and React Native which enabled them to learn and explore the field of mobile development"
    ],
    "logo": "CICSoft.webp"
  },
  {
    "title": "Undergraduate Research Volunteer",
    "organization": "University of Massacusetts Amherst",
    "location": "Amherst, Massachusetts, U.S.A.",
    "duration": "Dec 2021 - Jan 2022",
    "description": [
      "Developed an image classification model on CIFAR-10 dataset using neural network",
      "Transformed images to word embedding using gloVe word embedding",
      "Utilized cosine similarity between word embedding as metric for classification"
    ],
    "logo": "UMass-Amherst.webp"
  },
  {
    "title": "Software Engineer Intern",
    "organization": "KPMG",
    "location": "Harayana, India",
    "duration": "May 2021 - Aug 2021",
    "description": [
      "Developed a web scraper in Python, using Beautiful Soup library which scraped news articles based on provided keywords",
      "Implemented Machine Learning algorithms on different data sets along with hyperparameter tuning for higher efficiency"
    ],
    "logo": "KPMG.webp"
  }
]
