[
  {
    "id": 6,
    "title": "Graduate Student Researcher",
    "organization": "Mendel.ai",
    "location": "Remote, U.S.A.",
    "duration": "Feb 2024 - Aug 2024",
    "description": [
      "Worked on a Generative AI (GenAI) research project in the healthcare domain aimed at evaluating clinical summaries generated by Large Language Models (LLMs) and published our findings at KDD-AIDSH 2024 conference.",
      "Developed a faithfulness hallucination detection framework and analyzed the tradeoffs of using GPT-4o and Llama-3 as both evaluators and summary generators for clinical domain."
    ],
    "skills": [
      "Large Language Models (LLMS)",
      "Generative AI",
      "Machine Learning",
      "Natural Language Processing",
      "Python",
      "Research"
    ],
    "logo": "Mendel.webp"
  },
  {
    "id": 5,
    "title": "Data Operations Engineer Intern",
    "organization": "MAQ Software",
    "location": "Redmond, Washinton, U.S.A.",
    "duration": "Jun 2024 - Sep 2024",
    "description": [
      "As a part of data engineer team worked in optimizing ETL pipelines by leveraging Microsoft Azure Databricks for scalable big data processing, Azure Data Factory for orchestrating data workflows, Transact-SQL for data transformations, PySpark for distributed data handling, and Python and Scala for writing scripts.",
      "Implemented agile project management methods to track progress, manage risks, and ensure timely delivery of project milestones."
    ],
    "skills": [
      "Microsfot Azure",
      "Azure Databricks",
      "Data Factory",
      "Transact-SQL",
      "PySpark",
      "Python",
      "Scala",
      "ETL"
    ],
    "logo": "MAQ-Software.webp"
  },
  {
    "id": 4,
    "title": "Software Engineeer Intern",
    "organization": "Altius Strategic Consulting",
    "location": "California, U.S.A.",
    "duration": "May 2022 - Aug 2022",
    "description": [
      "Worked on an Android mobile application focusing on developing and optimizing scalable software infrastructure.",
      "Deployed Amazon S3 to establish secure and scalable cloud storage, AWS Lambda to facilitate serverless computing tasks, Amazon DynamoDB to streamline database management, Amazon Cognito to handle access management as part of the backend development.",
      "Optimized app performance to faster process tasks through multithreading, following best version control practices.",
      "Designed and implemented user-friendly interfaces and integrated secure user authentication via Firebase."
    ],
    "skills": ["Android", "Java", "AWS", "Firebase"],
    "logo": "ASC.webp"
  },
  {
    "id": 3,
    "title": "Frontend Intern",
    "organization": "AudioShelf",
    "location": "Amherst, Massachusetts, U.S.A.",
    "duration": "Nov 2022 - Feb 2023",
    "description": [
      "Revamped the AudioShelf mobile app using React Native in TypeScript, offering audiobooks in 30+ languages to 2000+ users.",
      "Improved mobile application performance and reduced server load by 30% by through caching showing strong problem solving skills.",
      "Implemented 6+ new features, logged and addressed 15+ identified issues, and resolved 12+ bugs.",
      "Improved user engagement by incorporating deep linking for navigation between the mobile application and external sources."
    ],
    "googlePlayStore": "https://play.google.com/store/apps/details?id=com.audioshelfapp",
    "appStore": "https://apps.apple.com/us/app/audioshelf/id6443459241",
    "skills": ["React Native", "TypeScript"],
    "logo": "AudioShelf.webp"
  },
  {
    "id": 2,
    "title": "Software Developer",
    "organization": "CICSoft",
    "location": "Amherst, Massachusetts, U.S.A.",
    "duration": "Feb 2022 - May 2022",
    "description": [
      "Integrated features for the organization’s admin dashboard using React with TypeScript, Tailwind CSS, and Firebase",
      "Created new features for member management that include a search bar, filtering options to help administrators find specific members easily, tracking and handling member applications in an intuitive GUI system",
      "Engineered Firebase Realtime Database integration for real-time updates in the member data using the Node.js SDK",
      "Collaborated with the development team to design user-friendly interfaces that optimize the user experience",
      "Conducted bootcamp sessions for 50 students on Android and React Native which enabled them to learn and explore the field of mobile development"
    ],
    "skills": ["React", "TypeScript", "Tailwind CSS", "Firebase"],
    "logo": "CICSoft.webp"
  },

  {
    "id": 1,
    "title": "Software Engineer Intern",
    "organization": "KPMG",
    "location": "Harayana, India",
    "duration": "May 2021 - Aug 2021",
    "description": [
      "Developed a Python web scraper using Selenium to retrieve project support data as part of the Data Engineering Platform Team."
    ],
    "skills": ["Python", "Selenium"],
    "logo": "KPMG.webp"
  }
]
