[
  {
    "id": 5,
    "title": "Frontend Intern",
    "organization": "AudioShelf",
    "location": "Amherst, Massachusetts, U.S.A.",
    "duration": "Nov 2022 - Feb 2023",
    "description": [
      "Worked on the mobile app for streaming audio books using React Native in TypeScript",
      "Implemented caching in the app, which reduced server load by 30% thus improving app performance and user experience",
      "Incorporated deep linking for seamless navigation between the mobile application and external sources",
      "Performed code reviews to maintain high code quality and performance standards",
      "Added 6+ new features, raised 15+ issues, and resolved 12+ bugs"
    ],
    "googlePlayStore": "https://play.google.com/store/apps/details?id=com.audioshelfapp",
    "appStore": "https://apps.apple.com/us/app/audioshelf/id6443459241",
    "skills": ["React Native", "TypeScript"],
    "logo": "AudioShelf.webp"
  },
  {
    "id": 4,
    "title": "Software Engineeer Intern",
    "organization": "Altius Strategic Consulting",
    "location": "California, U.S.A.",
    "duration": "May 2022 - Aug 2022",
    "description": [
      "Architected cloud services through AWS Lambda, DynamoDB, API Gateway, S3 into the mobile application",
      "Developed client-facing user interface and implemented user authentication via Firebase",
      "Documented all processes, code changes, and troubleshooting steps for future reference and to ensure smooth transitions between developers",
      "Contributed to the team's agile development process, participating in sprint planning, stand-ups, and retrospectives"
    ],
    "skills": ["Android", "Java", "AWS", "Firebase"],
    "logo": "ASC.webp"
  },
  {
    "id": 3,
    "title": "Software Developer",
    "organization": "CICSoft",
    "location": "Amherst, Massachusetts, U.S.A.",
    "duration": "Feb 2022 - Present",
    "description": [
      "Integrated features for the organization’s admin dashboard using React with TypeScript, Tailwind CSS, and Firebase",
      "Created new features for member management that include a search bar, filtering options to help administrators find specific members easily, tracking and handling member applications in an intuitive GUI system",
      "Engineered Firebase Realtime Database integration for real-time updates in the member data using the Node.js SDK",
      "Collaborated with the development team to design user-friendly interfaces that optimize the user experience",
      "Conducted bootcamp sessions for 50 students on Android and React Native which enabled them to learn and explore the field of mobile development"
    ],
    "skills": ["React", "TypeScript", "Tailwind CSS", "Firebase"],
    "logo": "CICSoft.webp"
  },
  {
    "id": 2,
    "title": "Undergraduate Research Volunteer",
    "organization": "University of Massacusetts Amherst",
    "location": "Amherst, Massachusetts, U.S.A.",
    "duration": "Dec 2021 - Jan 2022",
    "description": [
      "Developed an image classification model on CIFAR-10 dataset using neural network",
      "Transformed images to word embedding using gloVe word embedding",
      "Utilized cosine similarity between word embedding as metric for classification"
    ],
    "skills": ["Python", "Machine Learning"],
    "logo": "UMass-Amherst.webp"
  },
  {
    "id": 1,
    "title": "Software Engineer Intern",
    "organization": "KPMG",
    "location": "Harayana, India",
    "duration": "May 2021 - Aug 2021",
    "description": [
      "Developed a web scraper in Python, using Beautiful Soup library which scraped news articles based on provided keywords",
      "Implemented Machine Learning algorithms on different data sets along with hyperparameter tuning for higher efficiency"
    ],
    "skills": ["Python", "Machine Learning", "Beautiful Soup"],
    "logo": "KPMG.webp"
  }
]
